app/controllers/bookclubs_controller.rb

SELECT "bookclubs".* FROM "bookclubs"
---
  def index
    @bookclubs = Bookclub.all

INSERT INTO "bookclubs" ("name", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Slim Shady Bookclub"], ["genre", "Mystery"], ["created_at", "2020-07-11 15:50:28.403208"], ["updated_at", "2020-07-11 15:50:28.403208"]]
---
  def create
    @bookclub = Bookclub.new(bookclub_params)

    if @bookclub.save

DELETE FROM "bookclubs" WHERE "bookclubs"."id" = $1  [["id", 4]]
---
  def destroy
    @bookclub.destroy

SELECT "bookclubs".* FROM "bookclubs" WHERE "bookclubs"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_bookclub
      @bookclub = Bookclub.find(params[:id])