app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Slim Shady Bookclub"], ["created_at", "2020-07-11 02:42:23.733508"], ["updated_at", "2020-07-11 02:42:23.733508"]]